---
kind: enumMember
id: F:Autodesk.Revit.DB.ElementOnPhaseStatus.Demolished
enum: Autodesk.Revit.DB.ElementOnPhaseStatus
source: html/bfc481cc-11c8-de0b-1d71-7b2ffa711780.htm
---
# Autodesk.Revit.DB.ElementOnPhaseStatus.Demolished

Created before the given phase, to be demolished on the given phase